---
kind: method
id: M:Autodesk.Revit.DB.Plumbing.FluidTemperatureSetIterator.GetCurrent
source: html/b9035a98-c5b6-5b8d-6a47-2f575435c8e5.htm
---
# Autodesk.Revit.DB.Plumbing.FluidTemperatureSetIterator.GetCurrent Method

Returns the current FluidTemperature.

## Syntax (C#)
```csharp
public FluidTemperature GetCurrent()
```

## Returns
The current FluidTemperature.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - There is no current item in the iterator.